blog/2018/04/16/通过命令行实现笔记本的按键功能/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>通过命令行实现笔记本的按键功能 - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="emacs-common" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document.git">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">通过命令行实现笔记本的按键功能</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#controlling-the-power-key">控制电源键</a></li>
<li><a href="#toggling-the-touchpad">切换触摸板</a></li>
<li><a href="#lock-screen">锁屏</a></li>
<li><a href="#battery-status">电池状态</a></li>
<li><a href="#simple-wifi-management">简单的Wifi管理</a></li>
<li><a href="#simple-quick-transitions-to-multiple-monitors">简单地快速切换到多个监视器</a></li>
<li><a href="#audio-volume">音频音量</a></li>
<li><a href="#screen-brightness">屏幕亮度</a></li>
<li><a href="#screenshot">截图</a></li>
<li><a href="#alt-tab-buffer-swapping">使用Alt-Tab切换Buffer</a></li>
<li><a href="#my-full-setup">我的全部设置</a></li>
</ul>
</div>
</div>
<p>
<b>编辑添加:</b>
</p>

<ul class="org-ul">
<li>2018.03.28 自从我现在使用nm-applet后，就补充了网络部分的内容,此外还添加了Alt+Tab交换缓冲区和emacs.el的exwm部分的内容。</li>
</ul>

<p>
我正在尝试使用exwm,它与i3wm体验类似(但文档记录较少)，重量级的窗口管理器能为您的笔记本电脑提供很多功能。目前我旅行用的笔记本电脑就经常使用这些功能，我每天用它连接不同的wifi网络，连接对接站，连接额外的显示器和其他设备，切换触摸板等等。
在我寻求在exwm实现这些功能的过程中，我主要解决了以下这些问题。
</p>

<div id="outline-container-org1449715" class="outline-2">
<h2 id="controlling-the-power-key"><a id="org1449715"></a>控制电源键</h2>
<div class="outline-text-2" id="text-controlling-the-power-key">
<p>
电源按钮不是由窗口管理器管理的，而是由systemd管理的
</p>

<p>
例如，在我的 <code>/etc/systemd/logind.conf</code> 中有以下内容
</p>

<pre class="example">
[Login]
HandlePowerKey=hibernate
HandleLidSwitch=ignore
IdleAction=suspend
IdleActionSec=20min
</pre>
</div>
</div>

<div id="outline-container-org758e3e6" class="outline-2">
<h2 id="toggling-the-touchpad"><a id="org758e3e6"></a>切换触摸板</h2>
<div class="outline-text-2" id="text-toggling-the-touchpad">
<p>
这是通过shell脚本实现的:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span>

<span style="font-weight: bold;">declare</span> -i ID
<span style="font-weight: bold; font-style: italic;">ID</span>=<span style="font-weight: bold;">`xinput list | grep -Eo 'Touchpads*id=[0-9]{1,2}' | grep -Eo '[0-9]{1,2}'`</span>
<span style="font-weight: bold;">declare</span> -i STATE
<span style="font-weight: bold; font-style: italic;">STATE</span>=<span style="font-weight: bold;">`xinput list-props $ID|grep 'Device Enabled'|awk '{print $4}'`</span>
<span style="font-weight: bold;">if</span> [ $<span style="font-weight: bold; font-style: italic;">STATE</span> -eq 1 ]
<span style="font-weight: bold;">then</span>
    xinput disable $<span style="font-weight: bold; font-style: italic;">ID</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Touchpad disabled."</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">notify-send -a 'Touchpad' 'Disabled' -i /usr/share/icons/Adwaita/48x48/devices/input-touchpad.png</span>
<span style="font-weight: bold;">else</span>
    xinput enable $<span style="font-weight: bold; font-style: italic;">ID</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Touchpad enabled."</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">notify-send -a 'Touchpad' 'Enabled' -i /usr/share/icons/Adwaita/48x48/devices/input-touchpad.png</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div>

<p>
然后我将该脚本绑定到我想要的快捷键上(因为我使用exwm，所以我将它配置到我的emacs.el中，并以 <code>touchpad_toggle</code> 作为脚本名):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(exwm-input-set-key (kbd <span style="font-style: italic;">"s-&lt;f7&gt;"</span>)
                    (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>)
                      (shell-command (executable-find <span style="font-style: italic;">"touchpad_toggle"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3093324" class="outline-2">
<h2 id="lock-screen"><a id="org3093324"></a>锁屏</h2>
<div class="outline-text-2" id="text-lock-screen">
<p>
xscreensaver解决了这个问题。一旦从repos安装了xscreensaver后(包括额外包以获得我想要的作为锁屏屏保的gl-slideshow),我通过 <code>xscreensaver-demo</code> 来配置屏保。
然后我创建了一个名为 <code>lockscreen</code> 的单行程序，并将它写入我的emacs文件:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span>

xscreensaver-command -lock
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(exwm-input-set-key (kbd <span style="font-style: italic;">"s-l"</span>) (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (shell-command (executable-find <span style="font-style: italic;">"lockscreen"</span>))))
</pre>
</div>

<p>
然后就是关闭锁屏时遇到了一个问题:
</p>

<p>
<a href="https://unix.stackexchange.com/questions/81692/suspend-and-lock-screen-on-closing-lid-in-arch-systemd">https://unix.stackexchange.com/questions/81692/suspend-and-lock-screen-on-closing-lid-in-arch-systemd</a>
</p>
</div>
</div>

<div id="outline-container-org99c5741" class="outline-2">
<h2 id="battery-status"><a id="org99c5741"></a>电池状态</h2>
<div class="outline-text-2" id="text-battery-status">
<p>
简单地使用 <code>fancy-battery</code> mode 就好 (它现在已经不再维护的，但我在melpa上安装好它后，目前在我电脑上工作正常)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package fancy-battery
  <span style="font-weight: bold;">:ensure</span> t
  (fancy-battery-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org64de9b6" class="outline-2">
<h2 id="simple-wifi-management"><a id="org64de9b6"></a>简单的Wifi管理</h2>
<div class="outline-text-2" id="text-simple-wifi-management">
<p>
nmtui 带有一个很好的NetworkManager文本接口，它的接口也是最简单的。问题是，它不能用于任何一种Emacs终端中，这些Emacs终端作为是我的shell解决方案已经有很长一段时间了。
</p>

<p>
放弃通过CLI接口来管理Wifi，我发现 <code>nm-applet</code> 挺不错的。它的图标停靠屏幕的底部而且还具有我想要的密码记忆和自动连接功能。
</p>
</div>
</div>

<div id="outline-container-orgbde4c5b" class="outline-2">
<h2 id="simple-quick-transitions-to-multiple-monitors"><a id="orgbde4c5b"></a>简单地快速切换到多个监视器</h2>
<div class="outline-text-2" id="text-simple-quick-transitions-to-multiple-monitors">
<p>
However, exwm has solutions for this, which go into my emacs.el file:
当我插入一个外部显示器时，在KDE下只需要简单地插上显示器就可以了(尽管我可能需要做调整一下分辨率)。
但是在exwm中，这么做什么都不会发生。不过，exwm对此有解决方案，我把这些解决方案放入我的emacs.el文件中:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">exwm-randr</span>)
(<span style="font-weight: bold;">setq</span> exwm-randr-workspace-output-plist '(0 <span style="font-style: italic;">"DP-1"</span>)) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">DP-1 being the name of my new monitor as shown by `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">randr</span><span style="font-weight: bold; font-style: italic;">'</span>
(add-hook 'exwm-randr-screen-change-hook
          (<span style="font-weight: bold;">lambda</span> ()
            (start-process-shell-command
             <span style="font-style: italic;">"xrandr"</span> nil <span style="font-style: italic;">"xrandr --output DP-1 --left-of eDP-1 --auto"</span>))) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">eDP-1 being the name of my original (laptop) monitor</span>
(exwm-enable)
(exwm-randr-enable)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2eea828" class="outline-2">
<h2 id="audio-volume"><a id="org2eea828"></a>音频音量</h2>
<div class="outline-text-2" id="text-audio-volume">
<p>
幸好我的声音是基于Alsa的，所以不需要安装任何东西。
根据之前在不同设备上的尝试经验，声音是很难处理的。
通过Alsa，我可以在exwm配置中调节音量。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(exwm-input-set-key (kbd <span style="font-style: italic;">"&lt;XF86AudioLowerVolume&gt;"</span>)
                    (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (shell-command <span style="font-style: italic;">"amixer set Master 5%-"</span>)))
(exwm-input-set-key (kbd <span style="font-style: italic;">"&lt;XF86AudioRaiseVolume&gt;"</span>)
                    (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (shell-command <span style="font-style: italic;">"amixer set Master 5%+"</span>)))
(exwm-input-set-key (kbd <span style="font-style: italic;">"&lt;XF86AudioMute&gt;"</span>)
                    (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (shell-command <span style="font-style: italic;">"amixer set Master 1+ toggle"</span>)))
</pre>
</div>
</div>
</div>
