emacs-common/通过命令行实现笔记本的按键功能.org
* 屏幕亮度
:PROPERTIES:
:CUSTOM_ID: screen-brightness
:END:

我在KDE下可以通过硬件键使我的屏幕变暗/变亮。我怎样才能在exwm中恢复这个功能?答案是light包(它比xbacklight容易得多，后者总是告诉我“No outputs have backlight property”)。

[[https://github.com/haikarainen/light]]

按照说明安装后再设置好快捷键:

#+begin_src emacs-lisp
  (exwm-input-set-key (kbd "<XF86MonBrightnessDown>") (lambda () (interactive) (shell-command "light -U 5; light")))
  (exwm-input-set-key (kbd "<XF86MonBrightnessUp>") (lambda () (interactive) (shell-command "light -A 5; light")))
#+end_src

* 截图
:PROPERTIES:
:CUSTOM_ID: screenshot
:END:

我写这篇文章时，意识到我最不需要的就是截屏。
我最喜欢的截图工具是KDE自带的 *Spectacle*. 我已经安装安装好了它，因此只需要把它绑定到Printscreen键就行了:

#+begin_src emacs-lisp
  (exwm-input-set-key (kbd "<print>") (lambda () (interactive) (start-process-shell-command "spectacle" nil "spectacle")))
#+end_src

* 使用Alt-Tab切换Buffer
:PROPERTIES:
:CUSTOM_ID: alt-tab-buffer-swapping
:END:

通过iflipb包很容易就能重新获得 =alt+tab= 的功能(这个功能我经常在其他系统上使用)。下载后，我只需要配置一下:

#+begin_src emacs-lisp
  (exwm-input-set-key (kbd "M-<tab>") 'iflipb-next-buffer)
  (exwm-input-set-key (kbd "M-<iso-lefttab>") 'iflipb-previous-buffer)
#+end_src

