blog/2018/04/16/通过命令行实现笔记本的按键功能/index.html

<div id="outline-container-org99ef290" class="outline-2">
<h2 id="screen-brightness"><a id="org99ef290"></a>屏幕亮度</h2>
<div class="outline-text-2" id="text-screen-brightness">
<p>
我在KDE下可以通过硬件键使我的屏幕变暗/变亮。我怎样才能在exwm中恢复这个功能?答案是light包(它比xbacklight容易得多，后者总是告诉我“No outputs have backlight property”)。
</p>

<p>
<a href="https://github.com/haikarainen/light">https://github.com/haikarainen/light</a>
</p>

<p>
按照说明安装后再设置好快捷键:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(exwm-input-set-key (kbd <span style="font-style: italic;">"&lt;XF86MonBrightnessDown&gt;"</span>) (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (shell-command <span style="font-style: italic;">"light -U 5; light"</span>)))
(exwm-input-set-key (kbd <span style="font-style: italic;">"&lt;XF86MonBrightnessUp&gt;"</span>) (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (shell-command <span style="font-style: italic;">"light -A 5; light"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org447fac9" class="outline-2">
<h2 id="screenshot"><a id="org447fac9"></a>截图</h2>
<div class="outline-text-2" id="text-screenshot">
<p>
我写这篇文章时，意识到我最不需要的就是截屏。
我最喜欢的截图工具是KDE自带的 <b>Spectacle</b>. 我已经安装安装好了它，因此只需要把它绑定到Printscreen键就行了:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(exwm-input-set-key (kbd <span style="font-style: italic;">"&lt;print&gt;"</span>) (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (start-process-shell-command <span style="font-style: italic;">"spectacle"</span> nil <span style="font-style: italic;">"spectacle"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf00a277" class="outline-2">
<h2 id="alt-tab-buffer-swapping"><a id="orgf00a277"></a>使用Alt-Tab切换Buffer</h2>
<div class="outline-text-2" id="text-alt-tab-buffer-swapping">
<p>
通过iflipb包很容易就能重新获得 <code>alt+tab</code> 的功能(这个功能我经常在其他系统上使用)。下载后，我只需要配置一下:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(exwm-input-set-key (kbd <span style="font-style: italic;">"M-&lt;tab&gt;"</span>) 'iflipb-next-buffer)
(exwm-input-set-key (kbd <span style="font-style: italic;">"M-&lt;iso-lefttab&gt;"</span>) 'iflipb-previous-buffer)
</pre>
</div>
</div>
</div>
